DataProcessors/ПроверитьЭтапЭкспертизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПроверитьЭтапЭкспертизы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПроверитьЭтапЭкспертизы/Ext/ObjectModule.bsl
Процедура РегламентноеВыполнение() Экспорт 
	ПроверитьЭтапЭкспертизы();
КонецПроцедуры

Процедура ПроверитьЭтапЭкспертизы() Экспорт

	ЗапросЗаявокНаВозврат = Новый Запрос;
	ЗапросЗаявокНаВозврат.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозвратТовары.Ссылка КАК ЗаявкаНаВозврат
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка.Проведен
	|	И ЗаявкаНаВозвратТовары.Тип = ""Рекламация""
	|	И ЗаявкаНаВозвратТовары.Ссылка.Статус = ""На экспертизе""
	//|	И НЕ ЗаявкаНаВозвратТовары.Ссылка.ЭтапЭкспертизы = ЗНАЧЕНИЕ(Перечисление.ЭтапыЭкспретизы.Подготовка)
	|	И НЕ ЗаявкаНаВозвратТовары.Ссылка.ЭтапЭкспертизы = ЗНАЧЕНИЕ(Перечисление.ЭтапыЭкспретизы.ПустаяСсылка)";
	
	РезультатЗапросаЗаявокНаВозврат = ЗапросЗаявокНаВозврат.Выполнить();
	
	Если НЕ РезультатЗапросаЗаявокНаВозврат.Пустой() Тогда
		
		ВыборкаЗаявокНаВозврат = РезультатЗапросаЗаявокНаВозврат.Выбрать();
		
		ТаблицаСсылок = Новый ТаблицаЗначений;
		ТаблицаСсылок.Колонки.Добавить("ГУИДЗаявкиНаВозврат");
		ТаблицаСсылок.Колонки.Добавить("ЭтапЭкспертизы");
		
		Пока ВыборкаЗаявокНаВозврат.Следующий() Цикл
			
			НоваяСтрокаТаблицы = ТаблицаСсылок.Добавить();
			НоваяСтрокаТаблицы.ГУИДЗаявкиНаВозврат = СокрЛП(ВыборкаЗаявокНаВозврат.ЗаявкаНаВозврат.УникальныйИдентификатор());
			
		КонецЦикла;
		
		Если НЕ ТаблицаСсылок.Количество() = 0 Тогда
			
			Результат = МСКWEB.ПолучитьЭтапыЭкспертизы(ТаблицаСсылок);
			
			Если Результат.Загружен Тогда 
				
				СписокДанных = Результат.СписокДанных;
				
				Для Каждого СтрокаСпискаДанных Из СписокДанных Цикл
					
					Если ЗначениеЗаполнено(СтрокаСпискаДанных.ЭтапЭкспертизы) Тогда
						
						ЕстьЭтапЭкспертизы = Перечисления.ЭтапыЭкспретизы[СтрокаСпискаДанных.ЭтапЭкспертизы]; 
						
						Если НЕ ЕстьЭтапЭкспертизы.Пустая() Тогда
							
							ДокументЗаявкаНаВозврат = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаСпискаДанных.ГУИДЗаявкиНаВозврат));
							
							Если НЕ ДокументЗаявкаНаВозврат.Пустая() И НЕ ДокументЗаявкаНаВозврат.ЭтапЭкспертизы = ЕстьЭтапЭкспертизы Тогда
								
								ОбъектЗаявкаНаВозврат = ДокументЗаявкаНаВозврат.ПолучитьОбъект();
								ОбъектЗаявкаНаВозврат.ЭтапЭкспертизы = ЕстьЭтапЭкспертизы;
								ОбъектЗаявкаНаВозврат.ДатаИзмененияЭтапаЭкспертизы = ТекущаяДата();
								
								Попытка
									ОбъектЗаявкаНаВозврат.Записать();
								Исключение
								КонецПопытки;
								
							КонецЕсли;
							
						КонецЕсли;						
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
